// eslint-disable-next-line consistent-return
function policyArr(tab: string) {
	if (tab === 'privacy') {
		return [
			{
				type: 'subTitle',
				text: '개인정보의 보호 및 사용',
			},
			{
				type: 'contents',
				text: '1. 회사는 관계법령이 정하는 바에 따라 회원등록정보를 포함한 회원의 개인정보를 보호하기 위해 노력합니다.\n회원 개인 정보의 보호 및 사용에 대해서는 관련법령 및 회사의 개인정보보호정책이 적용됩니다.\n단, 회사의 공식사이트 이외의 웹에서 링크된 사이트에서는 회사의 개인정보보호정책이 적용되지 않습니다.\n또한 회사는 회원의 귀책사유로 인해 노출된 정보에 대해서 일체의 책임을 지지 않습니다.\n2. 회사는 이용자에게 제공하는 서비스의 양적, 질적 향상을 위하여 이용자의 개인정보를 제휴사에게 제공, 공유할 수 있으며, 이 때에는 반드시 이용자의 동의를 받아 필요한 최소한의 정보를 제공, 공유하며 누구에게 어떤 목적으로 어떤 정보를 제공, 공유하는지 명시합니다.\n3. 회원은 원하는 경우 언제든 회사에 제공한 개인정보의 수집과 이용에 대한 동의를 철회할 수 있으며, 동의의 철회는 회원 탈퇴를 하는 것으로 이루어집니다.\n4. 회사는 수탁자를 통해 개별 이벤트, 행사가 진행될 경우, 해당 이벤트 참여 신청 페이지를 통해 명시적으로 개인정보 취급위탁에 대한 회원 동의를 받도록 하겠습니다.',
			},
		];
	}
	if (tab === 'service') {
		return [
			{
				type: 'title',
				text: '제 1 장 총칙',
			},
			{
				type: 'subTitle',
				text: '제 1조 (목적)',
			},
			{
				type: 'contents',
				text: '본 약관은 사당행(이하 "회사"라 한다)에서 제공하는 얼음땡 서비스(이하 "서비스"라 한다)를 제공함에 있어 회사와 이용자의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.',
			},
			{
				type: 'subTitle',
				text: '제 2조 (용어의 정의)',
			},
			{
				type: 'contents',
				text: '1. 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.\n"서비스"란 회사가 이용자에게 서비스를 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 구성한 가상의 공간을 의미하며, 서비스 자체를 의미하기도 합니다.\n"회원(이하 "회원"이라 한다)"이란 개인정보를 제공하여 회원등록을 한 자로서 홈페이지의 정보를 지속적으로 제공받으며 홈페이지가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.\n"아이디(이하 "ID"라 한다)"란 회원의 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 회사가 승인하는 회원 고유의 계정 정보를 의미합니다.\n"비밀번호"란 회원이 부여 받은 ID와 일치된 회원임을 확인하고, 회원의 개인정보를 보호하기 위하여 회원이 정한 문자와 숫자의 조합을 의미합니다.\n"회원탈퇴(이하 "탈퇴"라 한다)"란 회원이 이용계약을 해지하는 것을 의미합니다.\n2. 본 약관에서 사용하는 용어의 정의는 제1항에서 정하는 것을 제외하고는 관계법령 및 서비스 별 안내에서 정하는 바에 의합니다.',
			},
			{
				type: 'subTitle',
				text: '제 3조 (이용약관의 효력 및 변경)',
			},
			{
				type: 'contents',
				text: '1. 회사는 본 약관의 내용을 회원이 쉽게 알 수 있도록 회원 가입 화면에 게시합니다.\n2. 회사는 약관의 규제에 관한 법률, 전자거래기본법, 전자 서명법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관련법을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.\n3. 회사는 본 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 회사가 제공하는 서비스 사이트의 초기 화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.\n다만, 회원에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 회사는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다.\n4. 회원은 개정된 약관에 대해 거부할 권리가 있습니다. 회원은 개정된 약관에 동의하지 않을 경우 서비스 이용을 중단하고 회원등록을 해지할 수 있습니다.\n단, 개정된 약관의 효력 발생일 이후에도 서비스를 계속 이용할 경우에는 약관의 변경사항에 동의한 것으로 간주합니다.\n5. 변경된 약관에 대한 정보를 알지 못해 발생하는 회원 피해는 회사가 책임지지 않습니다.',
			},
			{
				type: 'subTitle',
				text: '제 4조 (약관 외 준칙)',
			},
			{
				type: 'contents',
				text: '1. 본 약관은 회사가 제공하는 서비스에 관해 별도의 정책 및 운영규칙과 함께 적용됩니다.\n2. 본 약관에 명시되지 아니한 사항과 본 약관의 해석에 관하여는 관계법령에 따릅니다.',
			},
			{
				type: 'title',
				text: '제 2 장 이용약관 체결',
			},
			{
				type: 'title',
				text: '제 2 장 이용약관 체결',
			},
			{
				type: 'subTitle',
				text: '제 9조 (회원의 의무)',
			},
			{
				type: 'contents',
				text: '1. 회원은 본 약관에 규정하는 사항과 기타 회사가 정한 제반 규정, 서비스 이용안내 또는 공지사항 등 회사가 공지 또는 통지하는 사항 및 관계법령을 준수하여야 하며, 기타 회사의 업무에 방해가 되는 행위, 회사의 명예를 손상 시키는 행위를 하여서는 안됩니다.\n2. 회사가 관계법령 및 개인정보보호정책에 의하여 그 책임을 지는 경우를 제외하고 제11조의 관리소홀, 부정사용에 의하여 발생되는 모든 결과에 대한 책임은 회원에게 있습니다.\n3. 회원은 회사의 사전승낙 없이 서비스를 이용하여 영업활동을 할 수 없으며, 회원 간 또는 회원과 제3자 간에 서비스를 매개로 한 물품거래 및 서비스의 이용과 관련하여 기대하는 이익 등에 관하여 발생한 손해에 대하여 회사는 책임을 지지 않습니다. 이와 같은 영업활동으로 회사가 손해를 입은 경우 회원은 회사에 대하여 손해배상의 의무를 지며, 회사는 해당 회원에 대해 서비스 이용제한 및 적법한 절차를 거쳐 손해배상 등을 청구할 수 있습니다.\n4. 회원은 회사의 명시적인 동의가 없는 한 서비스의 이용권한, 기타 이용계약 상의 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다.\n5. 회원은 서비스 이용과 관련하여 제22조 제1항의 각 호에 해당하는 행위를 하여서는 안됩니다.\n6. 이용자는 회원가입 신청 또는 회원정보 변경 시 모든 사항을 사실에 근거하여 작성하여야 하며, 허위 또는 타인의 정보를 등록할 경우 일체의 권리를 주장할 수 없습니다.\n7. 회원은 주소, 연락처, 전자우편 주소 등 이용계약사항이 변경된 경우에 해당 절차를 거쳐 이를 회사에 즉시 알려야 합니다.\n8. 회원은 회사 및 제 3자의 지적 재산권을 침해해서는 안됩니다.\n9. 회원은 다음 각 호에 해당하는 행위를 하여서는 안되며, 해당 행위를 하는 경우에 회사는 회원의 서비스 이용제한 및 적법 조치를 포함한 제재를 가할 수 있습니다.\ni.회원가입 신청 또는 회원정보 변경 시 허위내용을 등록하는 행위\nii.다른 이용자의 ID, 비밀번호, 주민등록번호를 도용하는 행위\niii.이용자 ID를 타인과 거래하는 행위\niv.회사의 운영진, 직원 또는 관계자를 사칭하는 행위\nv.회사로부터 특별한 권리를 부여 받지 않고 회사의 클라이언트 프로그램을 변경하거나, 회사의 서버를 해킹하거나, 웹사이트 또는 게시된 정보의 일부분 또는 전체를 임의로 변경하는 행위\nvi.서비스에 위해를 가하거나 고의로 방해하는 행위\nvii.본 서비스를 통해 얻은 정보를 회사의 사전 승낙 없이 서비스 이용 외의 목적으로 복제하거나, 이를 출판 및 방송 등에 사용하거나, 제 3자에게 제공하는 행위\nviii.회사 또는 제 3자의 저작권 등 기타 지적재산권을 침해하는 내용을 전송, 게시, 전자우편 또는 기타의 방법으로 타인에게 유포하는 경우\nix.공공질서 및 미풍양속에 위반되는 저속, 음란한 내용의 정보, 문장, 도형, 음향, 동영상을 전송, 게시, 전자우편 또는 기타의 방법으로 타인에게 유포하는 행위\nx.모욕적이거나 개인신상에 대한 내용이어서 타인의 명예나 프라이버시를 침해할 수 있는 내용을 전송, 게시, 전자우편 또는 기타의 방법으로 타인에게 유포하는 행위\nxi.다른 이용자를 희롱 또는 위협하거나, 특정 이용자에게 지속적으로 고통 또는 불편을 주는 행위\nxii.회사의 승인을 받지 않고 다른 사용자의 개인정보를 수집 또는 저장하는 행위\nxiii.범죄와 결부된다고 객관적으로 판단되는 행위\nxiv.본 약관을 포함하여 기타 회사가 정한 제반 규정 또는 이용 조건을 위반하는 행위\nxv.기타 관계법령에 위배되는 행위',
			},
			{
				type: 'title',
				text: '제 4 장 서비스 이용',
			},
			{
				type: 'subTitle',
				text: '제 10조 (서비스의 제공 및 변경)',
			},
			{
				type: 'contents',
				text: '1. 회사는 회사가 제공하는 서비스에서 진행하는 콘텐츠와 이벤트 등의 모든 서비스를 회원에게 제공합니다.\n2. 회사에서 제공하는 서비스는 기본적으로 무료입니다. 유료서비스 추가 시 사전 공지하며 이용에 대한 사항은 회사가 별도로 정한 서비스 약관 및 정책 또는 운영규칙에 따릅니다.\n3. 회사는 서비스 변경 시 그 변경될 서비스의 내용 및 제공일자를 제 14조에 정한 방법으로 회원에게 통지합니다.',
			},
			{
				type: 'subTitle',
				text: '제 11조 (정보의 제공 및 통지)',
			},
			{
				type: 'contents',
				text: '1. 회사는 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항 혹은 전자우편 등의 방법으로 회원에게 제공할 수 있습니다.\n2. 회사는 불특정다수 회원에 대한 통지를 하는 경우 7일 이상 공지 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.',
			},
			{
				type: 'subTitle',
				text: '제 12조 (광고게재 및 광고주와의 거래)',
			},
			{
				type: 'contents',
				text: '1. 회사가 제공하는 서비스 내에 다양한 배너와 링크(Link)를 포함할 수 있으며, 이는 광고주와의 계약관계에 의하거나 제공받은 콘텐츠의 출처를 밝히기 위한 조치입니다.\n회원은 서비스 이용 시 노출되는 광고게재에 대해 동의합니다.\n2. 서비스 내에 포함되어 있는 링크를 클릭하여 타 사이트의 페이지로 옮겨갈 경우 해당 사이트의 개인정보보호정책은 회사와 무관합니다.',
			},
			{
				type: 'subTitle',
				text: '제 13조 (서비스 이용시간)',
			},
			{
				type: 'contents',
				text: '1. 서비스 이용은 회사의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간 운영을 원칙으로 합니다. 다만, 회사는 시스템 정기점검, 증설 및 교체를 위해 회사가 정한 날이나 시간에 서비스를 일시 중단할 수 있으며, 예정되어 있는 작업으로 인한 서비스 일시 중단은 회사가 제공하는 서비스를 통해 사전에 공지합니다.\n2. 회사는 서비스를 일정 범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있습니다. 다만, 이 경우 그 내용을 공지합니다.',
			},
			{
				type: 'subTitle',
				text: '제 14조 (서비스 제공의 중단 등)',
			},
			{
				type: 'contents',
				text: '1. 회사는 다음 각 호의 내용에 해당하는 경우 서비스 제공의 일부 혹은 전부를 제한하거나 중단할 수 있습니다.\ni.정보통신설비의 보수 점검, 교체 및 고장 등 공사로 인한 부득이 한 경우\nii.기간통신사업자가 전기통신서비스를 중단했을 경우\niii.서비스 이용의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우\niv.국가비상사태 등 기타 불가항력적인 사유가 있는 경우\n2. 전항에 의한 서비스 중단의 경우에는 회사는 제14조에 정한 방법으로 그 사유 및 기간 등을 공지합니다. 다만, 회사가 통제할 수 없는 사유로 발생한 서비스의 중단 (시스템관리자의 고의, 과실 없는 디스크 장애, 시스템다운 등)에 대하여 사전공지가 불가능한 경우에는 예외로 합니다.',
			},
			{
				type: 'subTitle',
				text: '제 15조 (회원 ID 관리)',
			},
			{
				type: 'contents',
				text: '1. 회원 ID와 비밀번호에 관한 모든 관리책임은 회원에게 있습니다.\n2. 회사는 회원 ID에 의하여 제반 회원 관리업무를 수행하므로 회원이 ID를 변경하고자 하는 경우 회사가 인정할 만한 사유가 없는 한 ID의 변경을 제한할 수 있습니다.\n3. 회원이 등록한 회원 ID 및 비밀번호에 의하여 발생되는 사용상의 과실 또는 제3자에 의한 부정사용 등에 대한 모든 책임은 해당 이용고객에게 있습니다.',
			},
			{
				type: 'subTitle',
				text: '제 16조 (정보의 제공)',
			},
			{
				type: 'contents',
				text: '1. 회사는 회원에게 서비스 이용에 필요가 있다고 인정되는 각종 정보에 대해서 전자우편이나 서신우편 등의 방법으로 회원에게 제공할 수 있습니다.\n2. 회사는 서비스 개선 및 회원 대상의 서비스 소개 등의 목적으로 회원의 동의 하에 추가적인 개인 정보를 요구할 수 있습니다.',
			},
			{
				type: 'subTitle',
				text: '제 15조 (회원 ID 관리)',
			},
			{
				type: 'contents',
				text: '1. 회원 ID와 비밀번호에 관한 모든 관리책임은 회원에게 있습니다.\n2. 회사는 회원 ID에 의하여 제반 회원 관리업무를 수행하므로 회원이 ID를 변경하고자 하는 경우 회사가 인정할 만한 사유가 없는 한 ID의 변경을 제한할 수 있습니다.\n3. 회원이 등록한 회원 ID 및 비밀번호에 의하여 발생되는 사용상의 과실 또는 제3자에 의한 부정사용 등에 대한 모든 책임은 해당 이용고객에게 있습니다.',
			},
			{
				type: 'title',
				text: '제 5 장 계약해지 및 이용제한',
			},
			{
				type: 'subTitle',
				text: '제 17조 (계약 변경 및 해지)',
			},
			{
				type: 'contents',
				text: '회원이 이용계약을 해지하고자 하는 경우에는 회원 본인이 사이트 내의 개인정보관리 페이지를 통해 등록해지 신청을 하여야 합니다.',
			},
			{
				type: 'subTitle',
				text: '제 18조 (서비스 이용 제한)',
			},
			{
				type: 'contents',
				text: '1. 회원은 본 약관 제11조, 제12조 내용을 위반하거나 다음 각 호에 해당하는 행위를 하는 경우에 회사는 회원의 서비스 이용을 제한할 수 있습니다.\ni.미풍양속을 저해하는 비속한 ID 및 별명 사용\nii.타 이용자에게 심한 모욕을 주거나, 서비스 이용을 방해한 경우\niii.정보통신 윤리위원회 등 관련 공공기관의 시정 요구가 있는 경우\niv.3개월 이상 서비스를 이용한 적이 없는 경우',
			},
			{
				type: 'title',
				text: '제 6 장 손해배상 및 기타사항',
			},
			{
				type: 'subTitle',
				text: '제 19조 (손해배상)',
			},
			{
				type: 'contents',
				text: '회사는 무료로 제공하는 서비스의 이용과 관련하여 개인정보보호정책에서 정하는 내용에 해당하지 않는 사항에 대하여는 어떠한 손해도 책임을 지지 않습니다.',
			},
			{
				type: 'subTitle',
				text: '제 20조 (면책조항)',
			},
			{
				type: 'contents',
				text: '1. 회사는 천재지변, 전쟁 및 기타 불가항력, 회사의 합리적인 통제범위를 벗어난 사유로 인하여 서비스를 제공할 수 없는 경우에는 그에 대한 책임이 면제됩니다.\n2. 회사는 기간통신 사업자가 전기통신 서비스를 중지하거나 정상적으로 제공하지 아니하여 손해가 발생한 경우 책임이 면제됩니다.\n3. 회사는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 발생한 손해에 대한 책임이 면제됩니다.\n4. 회사는 이용자의 귀책사유로 인한 서비스 이용의 장애 또는 손해에 대하여 책임을 지지 않습니다.\n5. 회사는 이용자의 컴퓨터 오류에 의해 손해가 발생한 경우, 또는 회원이 신상정보 및 전자우편 주소를 부실하게 기재하여 손해가 발생한 경우 책임을 지지 않습니다.\n6. 회사는 회원이 서비스를 이용하여 기대하는 수익을 얻지 못하거나 상실한 것에 대하여 책임을 지지 않습니다.',
			},
			{
				type: 'subTitle',
				text: '제 21조 (분쟁의 해결)',
			},
			{
				type: 'contents',
				text: '1. 회사와 회원은 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 노력을 합니다.\n2. 회사는 회원으로부터 제출되는 불만사항 및 의견을 우선적으로 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 회원에게 그 사유와 처리일정을 즉시 통보합니다.',
			},
			{
				type: 'subTitle',
				text: '제 23조 (재판권 및 준거법)',
			},
			{
				type: 'contents',
				text: '회사와 회원 간에 서비스 이용으로 발생한 분쟁에 대하여는 대한민국법을 적용하며, 본 분쟁으로 인하여 소송이 제기될 경우 민사소송법 상의 관할을 가지는 대한민국의 법원에 제기합니다.',
			},
		];
	}
}

export default policyArr;
